app/controllers/answers_controller.rb

  def index

    @question = Question.find(:all).last
    @already_answered = session[:answered_questions].include? @question.id
---
SELECT * FROM "questions"

  def create
    answer_option = AnswerOption.find(params[:answer_option_id])

    answer_option.answers.create!
---
SELECT * FROM "answer_options" WHERE ("answer_options"."id" = 2)
INSERT INTO "answers" ("updated_at", "answer_option_id", "created_at") VALUES('2009-10-30 10:04:13', 2, '2009-10-30 10:04:13')