app/controllers/questions_controller.rb

  def create
    question = Question.create! params[:question]
    answer_option_1 = question.answer_options.build :name => params[:answer_option_1] unless params[:answer_option_1].blank?
    answer_option_2 = question.answer_options.build :name => params[:answer_option_2] unless params[:answer_option_2].blank?
    answer_option_3 = question.answer_options.build :name => params[:answer_option_3] unless params[:answer_option_3].blank?

    answer_option_1.save! if answer_option_1
---
INSERT INTO "questions" ("name", "updated_at", "created_at") VALUES('asdfasdf', '2009-10-30 09:41:59', '2009-10-30 09:41:59')
INSERT INTO "answer_options" ("name", "updated_at", "question_id", "created_at") VALUES('a', '2009-10-30 09:51:29', 10, '2009-10-30 09:51:29')

  def show
    @question = Question.find(params[:id])
---
SELECT * FROM "questions" WHERE ("questions"."id" = 3)